In [1]:
print('============================================第6章=========================================================')

============================================第6章=========================================================

In [2]:
!type examples\\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('examples/ex1.csv')

In [5]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
pd.read_table('examples/ex1.csv', sep=',')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
!type examples\\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [8]:
df = pd.read_csv('examples/ex2.csv', header=None)

In [9]:
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [10]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
names = ['a', 'b', 'c', 'd', 'message']

In [12]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [13]:
!type examples\\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [14]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [15]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [16]:
list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [17]:
result = pd.read_table('examples/ex3.txt', sep='\s+')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

In [18]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [19]:
!type examples\\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [20]:
pd.read_csv('examples/ex4.csv', skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
!type examples\\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [22]:
result = pd.read_csv('examples/ex5.csv')

In [23]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [24]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [25]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [26]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [27]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [28]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [29]:
pd.options.display.max_rows = 10

In [30]:
result = pd.read_csv('examples/ex6.csv')

In [31]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [32]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [33]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [34]:
chunker

In [35]:
tot = pd.Series([])

In [36]:
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)

In [37]:
tot = tot.sort_values(ascending=False)

In [38]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [39]:
data = pd.read_csv('examples/ex5.csv')

In [40]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
data.to_csv('examples/out.csv')

In [42]:
!type examples\\out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [43]:
import sys

In [44]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [45]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [46]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [47]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [48]:
dates = pd.date_range('1/1/2000', periods=7)

In [49]:
import numpy as np

In [50]:
ts = pd.Series(np.arange(7), index=dates)

In [51]:
ts.to_csv('examples/tseries.csv')

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.

In [52]:
!type examples\\tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [53]:
!type examples\\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [54]:
import csv

In [55]:
f = open('examples/ex7.csv')

In [56]:
# 每行产生一个元祖(并移除了所有的引号)
reader = csv.reader(f)

In [57]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [58]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [59]:
header, values = lines[0], lines[1:]

In [60]:
header

['a', 'b', 'c']

In [61]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [62]:
data_dict = {h : v for h, v in zip(header, zip(*values))}

In [63]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [64]:
'''
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ','
    quotechar = '""'
    quoting = csv.QUOTE_MINIMAL
'''
print('定义新格式')

定义新格式

In [65]:
'''
with open('examples/mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerrow(('one','two','three'))
    writer.writerrow(('1','2','3'))
'''
print('操作csv文件')

操作csv文件

In [67]:
obj = """
{"name": "Wes", 
 "places_lived": ["United States", "Spain", "Germany"], 
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [68]:
import json

In [69]:
result = json.loads(obj)

In [70]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [71]:
asjson = json.dumps(result)

In [72]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [73]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [75]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [76]:
!type examples\\example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [77]:
data = pd.read_json('examples/example.json')

In [78]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [79]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [80]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [81]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [82]:
len(tables)

1

In [87]:
failures = tables[0]

In [88]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [89]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [90]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [91]:
from lxml import objectify

In [92]:
path = 'datasets/mta_perf/Performance_MNR.xml'

In [94]:
parsed = objectify.parse(open(path))

In [95]:
parsed

In [96]:
root = parsed.getroot()

In [97]:
data = []

In [98]:
skip_fields = ['PARNET_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [100]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [101]:
perf = pd.DataFrame(data)

In [103]:
perf.head()

,AGENCY_NAME,CATEGORY,DESCRIPTION,FREQUENCY,INDICATOR_NAME,INDICATOR_UNIT,MONTHLY_ACTUAL,MONTHLY_TARGET,PARENT_SEQ,PERIOD_MONTH,PERIOD_YEAR,YTD_ACTUAL,YTD_TARGET
0,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,,1,2008,96.9,95
1,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95,95,,2,2008,96,95
2,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,96.9,95,,3,2008,96.3,95
3,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,98.3,95,,4,2008,96.8,95
4,Metro-North Railroad,Service Indicators,Percent of commuter trains that arrive at thei...,M,On-Time Performance (West of Hudson),%,95.8,95,,5,2008,96.6,95

In [104]:
from io import StringIO

In [105]:
tag = '<a herf="http://www.google.com">Google</a>'

In [106]:
root = objectify.parse(StringIO(tag)).getroot()

In [107]:
root

In [108]:
root.get('herf')

'http://www.google.com'

In [109]:
root.text

'Google'

In [111]:
frame = pd.read_csv('examples/ex1.csv')

In [112]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [113]:
frame.to_pickle('examples/frame_pickle')

In [114]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [115]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [116]:
store = pd.HDFStore('mydata.h5')

In [117]:
store['obj1'] = frame

In [118]:
store['obj1_col'] = frame['a']

In [119]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [120]:
store['obj1']

           a
0  -0.279656
1   0.096723
2   1.053329
3  -0.124955
4   1.012908
..       ...
95  0.219828
96 -0.109866
97  0.392045
98 -1.502743
99 -0.870345

[100 rows x 1 columns]

In [121]:
store.put('obj2', frame, format='table')

In [122]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10 -0.084513
11  1.037128
12  0.860068
13 -0.972725
14 -0.085660
15 -0.387689

In [123]:
store.close()

In [124]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [125]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0 -0.279656
1  0.096723
2  1.053329
3 -0.124955
4  1.012908

In [126]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [127]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [128]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [129]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [130]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [131]:
writer

In [132]:
frame.to_excel(writer, 'Sheet1')

In [133]:
writer.save()

In [134]:
frame.to_excel('examples/ex2.xlsx')

In [135]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [136]:
import requests

In [137]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [139]:
resp = requests.get(url)

In [140]:
data = resp.json()

In [141]:
data[0]['title']

'TST: test passing index (and other iterables) to .loc'

In [145]:
issues = pd.DataFrame(data, columns=['number', 'title', 'labels', 'state'])

In [146]:
issues

,number,title,labels,state
0,27120,TST: test passing index (and other iterables) ...,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
1,27119,PERF: do not instantiate IndexEngine for stand...,[],open
2,27118,Plotting ExtensionArrays,[],open
3,27117,Make pandas.to_parquet handles partition colum...,[],open
4,27116,Bump python_requires to 3.5.2,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
...,...,...,...,...
25,27078,DOC/TST: provide documentation & testing on gr...,"[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
26,27076,Blacken the code base,"[{'id': 77550281, 'node_id': 'MDU6TGFiZWw3NzU1...",open
27,27075,Groupby ignores unobserved combinations when p...,[],open
28,27073,ENH: Json fill_value for missing fields,"[{'id': 49379259, 'node_id': 'MDU6TGFiZWw0OTM3...",open
29,27072,[POC] CLN: use ExtensionBlock for datetime tz ...,"[{'id': 849023693, 'node_id': 'MDU6TGFiZWw4NDk...",open

In [147]:
import sqlite3

In [148]:
query = """CREATE TABLE test(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER)"""

In [149]:
con = sqlite3.connect('mydata.sqlite')

In [150]:
con.execute(query)

In [151]:
con.commit()

In [153]:
data = [('Atlanta', 'Georgia', 1.25, 6), ('Tallahassee', 'Florida', 2.6, 3), ('Sacramento', 'California', 1.7, 5)]

In [154]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [155]:
con.executemany(stmt, data)

In [156]:
cursor = con.execute('select * from test')

In [158]:
rows = cursor.fetchall()

In [159]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [160]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [161]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [162]:
import sqlalchemy as sqla

In [163]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [166]:
pd.read_sql('select * from test', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []